Тестовая_база_ERP_14/src/Catalogs/CRM_ВидыВзаимодействий/CRM_ВидыВзаимодействий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_ВидыВзаимодействий</name>
  <predefined>
    <items>
      <name>Встреча</name>
      <description>Встреча</description>
    </items>
    <items>
      <name>ЛичнаяЗадача</name>
      <description>Задача</description>
    </items>
    <items>
      <name>ОбзвонКлиентов</name>
      <description>Обзвон клиентов</description>
    </items>
    <items>
      <name>ПотеряОбращения</name>
      <description>Потеря обращения</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.CRM_ВидыСобытий</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДела</name>
    <type>
      <types>CatalogRef.CRM_ВидыДелВзаимодействий</types>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>EnumRef.CRM_ВходящееИсходящееСобытие</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеИнтереса</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>Баллы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланироватьАвтоматическиПриПереходеВСосотояние</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановыйСрокДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Catalogs/CRM_ВидыВзаимодействий/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ЗначенияЗаполнения") 
		И (ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура")) 
		И Параметры.ЗначенияЗаполнения.Свойство("ВидДела") Тогда
		Объект.ВидДела = Параметры.ЗначенияЗаполнения.ВидДела;
	КонецЕсли;
	ВидДелаИнтерес = (Объект.ВидДела = ПредопределенноеЗначение("Справочник.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес"));
	Элементы.СостояниеИнтереса.Доступность = ВидДелаИнтерес;
	Элементы.ПланироватьАвтоматическиПриПереходеВСосотояние.Видимость = ВидДелаИнтерес;
	Элементы.ГруппаСрок.Видимость = ВидДелаИнтерес;
	Элементы.ПланироватьАвтоматическиПриПереходеВСосотояние.Видимость = ЗначениеЗаполнено(Объект.СостояниеИнтереса);
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ВидДелаПриИзменении(Элемент)
	Элементы.СостояниеИнтереса.Доступность = Объект.ВидДела = ПредопределенноеЗначение("Справочник.CRM_ВидыДелВзаимодействий.Документ_CRM_Интерес");
КонецПроцедуры

&НаКлиенте
Процедура СостояниеИнтересаПриИзменении(Элемент)
	Элементы.ПланироватьАвтоматическиПриПереходеВСосотояние.Видимость = ЗначениеЗаполнено(Объект.СостояниеИнтереса);
КонецПроцедуры

#КонецОбласти
